frontend/requests/UpdateRouteMVC.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://soap.ifmo.se/">
   <soapenv:Header/>
   <soapenv:Body>
      <soap:updateRoute>
         <id>19</id>
         <!--Optional:-->
         <updatedRoute>
             <name>UPDAAATE</name>
            <!--Optional:-->
            <coordinates>
               <!--Optional:-->
               <x>1</x>
               <!--Optional:-->
               <y>3</y>
            </coordinates>
            <!--Optional:-->
            <distance>166</distance>
         </updatedRoute>
      </soap:updateRoute>
   </soapenv:Body>
</soapenv:Envelope>